# 需求1. 根据用户输入的数字, 判断该数字是奇数还是偶数.
# num = int(input("请输入数字:"))
#
# if num % 2 == 0:
#     print("该数字是偶数")
# else:
#     print("该数字是奇数")

#需求2. 根据用户输入的年龄,判断用户是否已经成年 (>=18, 成年; 否则未成年).
# age = int(input("请输入您的年龄:"))
#
# if age >=18:
#     print("已成年")
# else:
#     print("未成年")

# #需求3. 根据用户输入的数字, 判断数字是正数还是负数(不考虑0)
# num = float(input("请输入数字:"))
#
# if num > 0:
#     print("正数")
# else:
#     print("负数")

#需求4. 根据用户输入的考试分数, 判断该分数是否及格了(大于等于60就是及格了).
num = float(input("请输入分数:"))

if num >= 60:
    print("考试及格!")
else:
    print("很遗憾,考试不及格!")